class ConvertsController < ApplicationController
  def new
    # カスタムキーボードと入力フォームを表示するアクション
  end

  def convert
    hiragana = params[:hiragana_text]
    lao_text = convert_to_lao(hiragana) # ひらがなをラオス文字に変換するメソッド
    render json: { lao: lao_text }
  end

  private

  def convert_to_lao(hiragana)
    # ひらがなからラオス文字へのマッピングを実装
    # 例: {'あ' => 'ອ', 'い' => 'ອີ', ... }
    mapping = {
      'あ' => 'ອາ',
      'い' => 'ອີ',
      'う' => 'ອູ',
      'え' => 'ເອ',
      'お' => 'ໂອ',
    
      # か行
      'か' => 'ຄາ',
      'き' => 'ຄີ',
      'く' => 'ຄູ',
      'け' => 'ເຄ',
      'こ' => 'ໂຄ',
    
      # さ行
      'さ' => 'ຊາ',
      'し' => 'ຊີ',
      'す' => 'ຊູ',
      'せ' => 'ເຊ',
      'そ' => 'ໂຊ',
    
      # た行
      'た' => 'ຕາ',
      'ち' => 'ຈີ',
      'つ' => 'ສູ',
      'て' => 'ເຕ',
      'と' => 'ໂຕ',
    
      # な行
      'な' => 'ນາ',
      'に' => 'ນີ',
      'ぬ' => 'ນູ',
      'ね' => 'ເນ',
      'の' => 'ໂນ',
    
      # は行
      'は' => 'ຫາ',
      'ひ' => 'ຫີ',
      'ふ' => 'ຫູ',
      'へ' => 'ເຮ',
      'ほ' => 'ໂຮ',
    
      # ま行
      'ま' => 'ມາ',
      'み' => 'ມີ',
      'む' => 'ມູ',
      'め' => 'ເມ',
      'も' => 'ໂມ',
    
      # や行
      'や' => 'ຢາ',
      'ゆ' => 'ຢູ',
      'よ' => 'ຢົ',
    
      # ら行
      'ら' => 'ລາ',
      'り' => 'ລີ',
      'る' => 'ລູ',
      'れ' => 'ເຣ',
      'ろ' => 'ໂຣ',
    
      # わ行
      'わ' => 'ວາ',
      'を' => 'ວົ',
      'ん' => 'ນ',
    
      # が行
      'が' => 'ກາ',
      'ぎ' => 'ກິ',
      'ぐ' => 'ກູ',
      'げ' => 'ເກ',
      'ご' => 'ໂກ',
    
      # ざ行
      'ざ' => 'ຊາ',
      'じ' => 'ຈີ',
      'ず' => 'ຊູ',
      'ぜ' => 'ເຊ',
      'ぞ' => 'ໂຊ',
    
      # だ行
      'だ' => 'ດາ',
      'ぢ' => 'ຈີ',
      'づ' => 'ຊູ',
      'で' => 'ເດ',
      'ど' => 'ໂດ',
    
      # きゃ行
      'きゃ' => 'ເຄຍ',
      'きゅ' => 'ຄີວ',
      'きょ' => 'ຄຽວ',
    
      # しゃ行
      'しゃ' => 'ເຊຍ',
      'しゅ' => 'ຊີວ',
      'しょ' => 'ຊຽວ',
    
      # ちゃ行
      'ちゃ' => 'ຈາ',
      'ちゅ' => 'ຈູ',
      'ちょ' => 'ໂຈ',
    
      # にゃ行
      'にゃ' => 'ຍາ',
      'にゅ' => 'ຍູ',
      'にょ' => 'ໂຍ',
    
      # ひゃ行
      'ひゃ' => 'ເຮຍ',
      'ひゅ' => 'ຮີວ',
      'ひょ' => 'ຮຽວ',
    
      # みゃ行
      'みゃ' => 'ເມຍ',
      'みゅ' => 'ມີວ',
      'みょ' => 'ມຽວ',
    
      # りゃ行
      'りゃ' => 'ລາ',
      'りゅ' => 'ລູ',
      'りょ' => 'ລຽວ',
    
      # ぎゃ行
      'ぎゃ' => 'ເກຍ',
      'ぎゅ' => 'ກີວ',
      'ぎょ' => 'ກຽວ',
    
      # じゃ行
      'じゃ' => 'ຈາ',
      'じゅ' => 'ຈູ',
      'じょ' => 'ໂຈ',
    
      # びゃ行
      'びゃ' => 'ເບຍ',
      'びゅ' => 'ບິວ',
      'びょ' => 'ບຽວ',
    
      # ぴゃ行
      'ぴゃ' => 'ເປຍ',
      'ぴゅ' => 'ປີວ',
      'ぴょ' => 'ປຽວ'
    }    

    lao_output = hiragana.chars.map { |char| mapping[char] || char }.join
    lao_output
  end
end
